Diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикиОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресДанныхДокумента = Параметры.АдресДанныхДокумента;
	ДанныеДокумента = ПолучитьИзВременногоХранилища(АдресДанныхДокумента);
	Год = ДанныеДокумента["Год"];
	ОтпускаСотрудников.Загрузить(ДанныеДокумента["ОтпускаСотрудников"]);
	
	// Вывод диаграммы Ганта
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ОбластьЗаголовка.Текст = "График отпусков на " + Формат(Год, "ДФ=yyyy;") + " г.";
	Диаграмма.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
	Диаграмма.АвтоОпределениеПолногоИнтервала = Истина;
	Шкала = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы.Вставить(0);
	Шкала.Единица = ТипЕдиницыШкалыВремени.Неделя;
	
	Серия = Диаграмма.Серии.Добавить();
	
	Для Каждого Отпуск Из ОтпускаСотрудников Цикл
		Точка = Диаграмма.УстановитьТочку(Отпуск.Сотрудник);
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Отпуск.ДатаНачала;
		Интервал.Конец = КонецДня(Отпуск.ДатаОкончания);
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти
